---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTypeId
source: html/09404c84-c732-376c-6da7-146bd8c6f14e.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.SegmentLengthDimensionTypeId Property

Identifies the Id of the linear dimension type which is used to show segments length.

## Syntax (C#)
```csharp
public ElementId SegmentLengthDimensionTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property:
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null